[
  {
    "NewsletterNumber":"1",
    "Cover":"https://nebraskaexaminer.com/wp-content/uploads/2024/01/Mayorkas-scaled-1.jpg",
    "Title":"MAYORKAS IMPEACHMENT",
    "Content":"This week, Republicans failed to impeach Alejandro N. Mayorkas, the U.S. secretary of homeland security, with a 214 - 216 loss. They argue that he has failed to enforce immigration laws, evidenced by an influx of illegal migrants flooding the U.S. and the insecurity of the southern border.",
    "SubTitle":"Domestic Affairs / Edition #1",
    "PublicationWeek":"2/4/24 - 2/10/24"
    },

    {
    "NewsletterNumber":"2",
    "Cover":"https://airlinestravel.ro/wp-content/uploads/2022/12/Super-Bowl-LVII-2023.jpg",
    "Title":"SUPER BOWL LVII",
    "Content":"Super Bowl LVII mixed football with pop culture. Usher's halftime show dazzled despite glitches, Taylor Swift's return from Tokyo made headlines, and Beyoncé announced a new album in a Verizon ad.  Hollywood studios debuted trailers for highly anticipated films like 'Wicked' and 'Twisters,' alongside the unexpected delight of 'Kung Fu Panda 4.'",
    "SubTitle":"Pop Culture / Edition #2",
    "PublicationWeek":"2/11/24 - 2/17/24"
    }, 

  {
    "NewsletterNumber":"3",
    "Cover":"https://static01.nyt.com/images/2024/02/25/multimedia/25pol-swiper-speeches-lfcb/25pol-swiper-speeches-lfcb-jumbo.jpg?quality=75&auto=webp",
    "Title":"SOUTH CAROLINA GOP PRIMARY",
    "Content":"Last Saturday, Donald Trump won the South Carolina GOP Primary (a primary is an election within a political party to determine the party’s nominee preference), beating former South Carolina governor and U.N. ambassador Nikki Haley. Many believe that Trump has already secured the GOP presidential nomination, casting further doubt on the long-term viability of Haley’s presidential campaign. A rematch between Trump and Biden is increasingly likely.",
    "SubTitle":"Domestic Affairs / Edition #3",
    "PublicationWeek":"2/18/24 - 2/24/24"
    }, 

  {
    "NewsletterNumber":"4",
    "Cover":"https://th.bing.com/th/id/OIP.wZmwh-YFEn57sWEiiOkETgAAAA?rs=1&pid=ImgDetMain",
    "Title":"AARON BUSHNELL",
    "Content":"US air force member Aaron Bushnell, 25, dies outside of the Israeli Embassy in Washington after lighting himself on fire as an act of protest against the ongoing Israeli-Gaza conflict. Mr. Bushnell livestreamed the protest on social media platform Twitch.",
    "SubTitle":"Domestic Affairs / Edition #4",
    "PublicationWeek":"2/25/24 - 3/2/24"
    }, 

  {
    "NewsletterNumber":"5",
    "Cover":"https://c.ndtvimg.com/2021-03/a4gkh75o_mike-tyson-afp_650x400_23_March_21.jpg",
    "Title":"MIKE TYSON",
    "Content":"At age 58, former heavyweight champion Mike Tyson will be getting back in the boxing ring against Jake Paul, the influncer turned boxer. Their match will be streamed live on Netflix on July 20th of this year, in the company’s attempt to push into “sports-adjacent programming,” which has the potential of drawing more people without crazy investments.",
    "SubTitle":"Domestic Affairs / Edition #5",
    "PublicationWeek":"3/3/24 - 3/9/24"
    }, 

  {
    "NewsletterNumber":"6",
    "Cover":"https://www.ecowatch.com/wp-content/uploads/2021/10/957032135-origin.png",
    "Title":"FRANCE ON FAST FASHION",
    "Content":"France's Parliament passed a groundbreaking bill to address fast fashion's environmental impact, targeting ads for cheap textiles and imposing levies on low-cost products. The focus is on promoting transparency and sustainable practices among fashion giants.",
    "SubTitle":"Domestic Affairs / Edition #6",
    "PublicationWeek":"3/10/24 - 3/16/24"
    }, 

  {
    "NewsletterNumber":"7",
    "Cover":"https://static01.nyt.com/images/2018/05/08/world/08Russia2/08Russia2-videoSixteenByNineJumbo1600.jpg",
    "Title":"PUTIN",
    "Content":"Russian President Vladmir Putin won the 2024 Russian presidential election, leading with 87.3% of the vote. Putin may be in office until 2036, and will be the longest-serving President since Joseph Stalin. Putin recently acknowledged Alexei Navalny’s death in an evening address (see Newsletter #3).",
    "SubTitle":"Global Affairs / Edition #7",
    "PublicationWeek":"3/17/24 - 3/23/24"
    },

  {
    "NewsletterNumber":"8",
    "Cover":"https://topmovierankings.com/wp-content/uploads/2024/02/Quiet-on-set-documentary.jpg",
    "Title":"DOCUMENTARY",
    "Content":"The 'Quiet on Set: The Dark Side of Kids TV' documentary gains more traction as events behind the scenes become publicly exposed. The series focuses on prolific TV creator Dan Schneider and his abuse of power, the multiple convicted pedophiles who worked on his hit Nickelodeon shows, and interviews with former child actors, parents, and crew members.",
    "SubTitle":"Enters / Edition #8",
    "PublicationWeek":"3/24/24 - 3/30/24"
    },

  {
    "NewsletterNumber":"9",
    "Cover":"https://i.abcnewsfe.com/a/a61706b6-e9e0-416b-8bd0-8fde78f2cbf4/heist-1-abc-bb-240404_1712237823771_hpMain_16x9.jpg?w=992",
    "Title":"$30 MILLION HEIST",
    "Content":"On Easter Day, Sunday night, one of the largest cash heists in the history of Los Angeles occurred, with a group of thieves stealing as much as $30 million dollars from an L.A. money storage facility - a facility used to store cash from businesses around the region. Baffled, the police and L.A. detectives have not been able to find the burglars yet.",
    "SubTitle":"Law and Justice / Edition #9",
    "PublicationWeek":"3/31/24 - 4/6/24"
    },

  {
    "NewsletterNumber":"10",
    "Cover":"https://media.newscentermaine.com/assets/WCSH/images/7723f9ec-fab0-4352-8da8-58c25e9e48ec/7723f9ec-fab0-4352-8da8-58c25e9e48ec_1140x641.jpg",
    "Title":"TOTAL ECLIPSE",
    "Content":"Today, April 8th, 2024, a total solar eclipse will appear, crossing over Mexico, the U.S., and Canada. This will be the last total solar eclipse in the U.S. until August 2044, 20 years from now. Severe storms and clouds may obscure the sky for eclipse tourists (millions have flocked to the east coast to watch the event), but tourists hope that the weather will cooperate. Wishing everyone a fun eclipse!",
    "SubTitle":"Environmental / Edition #10",
    "PublicationWeek":"3/31/24 - 4/6/24"
    },

  {
    "NewsletterNumber":"11",
    "Cover":"https://assets3.cbsnewsstatic.com/hub/i/r/2024/03/14/e23ff54a-ad8d-4693-b919-42909a97a992/thumbnail/620x404/a0ea93d9dbe7786324faceaa307f85c6/kim-jong-un-tank-north-korea.jpg?v=e6a7e661b3d1c604b3ae2bec0d66302a",
    "Title":"NORTH KOREA",
    "Content":"North Korean leader Kim Jong Un joins troops in training with newly developed battle tanks. In response to ongoing South Korean-U.S. military drills, which North Korea perceives as preparation for invasion, the activities, including the operation of advanced main battle tanks, serve as a direct response.",
    "SubTitle":"Global Affairs / Edition #11",
    "PublicationWeek":"3/10/24 - 3/16/24"
    },

  {
    "NewsletterNumber":"12",
    "Cover":"https://mydmi.imgix.net/tiktokcard2.jpg?crop=edges&fit=crop&fm=jpg&h=1260&ixlib=php-3.3.0&q=40&w=2400&s=e07eee409ce6b9474f79546e298a6e0c",
    "Title":"TIKTOK BAN",
    "Content":"Last week, Biden signed the TikTok Ban bill, which gave ByteDance, its Chinese-based parent company, a deadline of nine months to sell TikTok (and an additional three months if a sale is underway). The app is not currently banned, but will disappear from Apple and Google app stores if a ban is enforced. Lawmakers have raised concerns that China could influence ByteDance to manipulate the content on TikTok. ByteDance has denied all allegations. However, a set of Chinese national security laws, of which ByteDance is subjected to, mandates all its organizations and citizens to aid the Chinese government in efforts to gather intelligence.",
    "SubTitle":"Law and Justice / Edition #12",
    "PublicationWeek":"4/21/24 - 4/27/24"
    },

  {
    "NewsletterNumber":"13",
    "Cover":"https://assets.vogue.com/photos/66397e33bc8545e6386c752c/master/w_1280%2Cc_limit/2151802247",
    "Title":"MET GALA 2024",
    "Content":"The Met Gala, also known as the Costume Institute Benefit, is an annual fundraiser and high-profile fashion event held at the Metropolitan Museum of Art in New York City. This year's event will take place on May 6. The theme for the 2024 Met Gala is 'Sleeping Beauties: Reawakening Fashion,' with a dress code of 'The Garden of Time,' inspired by a 1962 short story by J.G. Ballard. The event will feature celebrity hosts Zendaya, Jennifer Lopez, Bad Bunny, Chris Hemsworth, and Anna Wintour.",
    "SubTitle":"Enters / Edition #13",
    "PublicationWeek":"4/28/24 - 5/4/24"
    },

  {
    "NewsletterNumber":"14",
    "Cover":"https://www.bing.com/images/blob?bcid=smU-.Klw0SEHcA",
    "Title":"RFK JR.",
    "Content":"Robert F. Kennedy Jr., an independent currently running for president (See Newsletter #13), confirmed that a parasitic worm ate a part of his brain, and subsequently died in his brain. The worm may have caused memory loss and cognitive issues for RFK. His symptoms appeared shortly after a diagnosis of mercury poisoning in 2012. Kennedy, however, has offered to “eat 5 more brain worms and still beat President Trump and President Biden in a debate.”",
    "SubTitle":"Enters / Edition #14",
    "PublicationWeek":"5/5/24 - 5/11/24"
    },

  {
    "NewsletterNumber":"15",
    "Cover":"https://www.twincities.com/wp-content/uploads/2023/10/Israel_Palestinians_Biden_65421-2.jpg?w=525",
    "Title":"$1 BILLION ARMS DEAL",
    "Content":"The Biden-Harris Administration intends on advancing a $1 billion arms sale to Israel. This package includes $60 million in mortar rounds, $500 million in tactical vehicles, and $700 million for tank ammunition. Biden has received backlash of his handling of the war in Gaza from both the left and the right. Members of Biden’s own party have demanded that Biden limit aid to Israel and redirect his attention to Palestinian civilians. Republican lawmakers, however, argue that aid to Israel is imminent.",
    "SubTitle":"Enters / Edition #15",
    "PublicationWeek":"5/12/24 - 5/18/24"
    },
  {
    "NewsletterNumber":"16",
    "Cover":"https://www.twincities.com/wp-content/uploads/2023/10/Israel_Palestinians_Biden_65421-2.jpg?w=525",
    "Title":"DAVID DEPAPE",
    "Content":"David DePape, a man who attacked former U.S. House Speaker Nancy Pelosi’s husband, with a hammer, has been sentenced to 30 years in prison. In October of 2022, DePape forcibly entered Pelosi’s San Francisco home, intent on kidnapping Pelosi, and assaulted Pelosi’s husband. DePape is also a Canadian citizen living illegally in the U.S., according to immigration officials.",
    "SubTitle":"LawAndJustice / Edition #16",
    "PublicationWeek":"5/19/24 - 5/25/24"
    },
  {
    "NewsletterNumber":"17",
    "Cover":"https://www.twincities.com/wp-content/uploads/2023/10/Israel_Palestinians_Biden_65421-2.jpg?w=525",
    "Title":"Nicki Minaj",
    "Content":"Nicki Minaj was apprehended by police at a Dutch airport, according to posts she shared on her social media. She livestreamed the encounter on her Instagram account, with a law enforcement officer telling her she was 'under arrest' for 'carrying drugs' and ordering her to get into a van to drive to a police station. Her Amsterdam concert was cancelled, following her drug arrest. Minaj was fined and permitted to continue her travels, but it is unclear as to whether she was charged with a crime.",
    "SubTitle":"LawAndJustice / Edition #17",
    "PublicationWeek":"5/26/24 - 6/1/24"
    },
  {
    "NewsletterNumber":"18",
    "Cover":"https://imagez.tmz.com/image/b3/4by3/2024/06/03/b374eeb9afd64d4ab7edb8a962c81d03_md.jpg",
    "Title":"LOUISANA",
    "Content":"Last Monday, Louisiana passed a Surgical Castration bill, allowing Lousiana judges to order surgical castration for child sex offenders. Sex crimes, such as molestation, rape, or incest, against a child under 13 will warrant surgical castration (if not, an additional three to five years of prison time). Several states (including Lousianna) already have laws that allow for chemical castration, decreasing sex drive. Surgical castration, however, will be a more invasive and severe consequence.",
    "SubTitle":"LawAndJustice / Edition #18",
    "PublicationWeek":"6/2/24 - 6/8/24"
    },
  {
    "NewsletterNumber":"19",
    "Cover":"https://www.hollywoodreporter.com/wp-content/uploads/2024/06/Teachers39SETUP_030d-H-2024.jpg?w=1024",
    "Title":"PAT SAJAK",
    "Content":"Pat Sajak, the host of 'Wheel of Fortune' for the past four decades, said goodbye to the show on Friday evening. In his final broadcast, which aired on June 7, Sajak, 77, sent a special message to the millions of viewers who have watched for decades. Ryan Seacrest was chosen as his replacement only weeks after the announcement.",
    "SubTitle":"LawAndJustice / Edition #19",
    "PublicationWeek":"6/9/24 - 6/15/24"
    },
  {
    "NewsletterNumber":"20",
    "Cover":"https://th.bing.com/th/id/OIP.PAWzNF68RtHe5rvvZOxFngAAAA?rs=1&pid=ImgDetMain",
    "Title":"INSIDE OUT 2",
    "Content":"Having been in the theater for only ten days, Disney and Pixar’s ‘Inside Out 2’, the prequel to ‘Inside Out’, has generated $725 million worldwide, passing ‘Dune’ as the top movie of 2024. Illumination and Universal’s ‘Despicable Me 4’, however, is to be released on July 3rd and may challenge ‘Inside Out 2’ at the box office.",
    "SubTitle":"ArtsAndCulture / Edition #20",
    "PublicationWeek":"6/16/24 - 6/22/24"
    },
  {
    "NewsletterNumber":"21",
    "Cover":"https://www.metro951.com/wp-content/uploads/2021/04/f608x342-351964_381687_0.png",
    "Title":"Morgan Freeman",
    "Content":"A TikTok video mimicking Morgan Freeman’s voice has drawn criticism from Freeman himself. On social media, Freeman called on the support of his fans in condemning the unauthorized A.I. voice imitations of him online. The creator has apologized for the video, and thought people would interpret the A.I. voiceover as comedic.",
    "SubTitle":"PopCulture / Edition #21",
    "PublicationWeek":"6/23/24 - 6/29/24"
    },
  {
    "NewsletterNumber":"22",
    "Cover":"https://th.bing.com/th/id/OIP.7z3IcTCo5cfujFYBsSwXawHaEK?rs=1&pid=ImgDetMain",
    "Title":"JON LANDAU",
    "Content":"Last Friday, Oscar-winning 'Titanic' and 'Avatar' producer Jon Landau passed away, according to his family. Landau’s cause of death has not been publicly announced. Disney Entertainment co-chairman Alan Bergman described Landau as a “visionary whose extraordinary talent and passion brought some of the most unforgettable stories to life on the big screen.”",
    "SubTitle":"LawAndJustice / Edition #22",
    "PublicationWeek":"6/30/24 - 7/6/24"
    },
  {
    "NewsletterNumber":"23",
    "Cover":"https://th.bing.com/th/id/OIP.5HnKwuwWQhc3c8Ux2eiWyAHaEK?rs=1&pid=ImgDetMain",
    "Title":"UKRAINE",
    "Content":"In Kyiv, Ukraine's biggest pediatrics facility Ohmatdyt Children's Hospital was hit by a wave of missile strikes launched by Russia on Ukraine. Two people, including a doctor, died in the hospital. 36 people were killed and 140 people were injured by the strikes. Patients, young children in particular, were evacuated from the hospital with IV drips attached.",
    "SubTitle":"GlobalAffairs / Edition #23",
    "PublicationWeek":"7/7/24 - 7/13/24"
    },
  {
    "NewsletterNumber":"24",
    "Cover":"https://dynaimage.cdn.cnn.com/cnn/digital-images/org/f7fc33a0-b7de-4968-b16f-def20e5c86ca.jpeg",
    "Title":"CLASSIFIED DOCUMENTS",
    "Content":"The classified documents case prosecution against former President Donald Trump was dismissed by a federal judge in Florida, last Monday. U.S. District Judge Aileen Cannon justified the dismissal by the illegitimacy surrounding the special counsel who had filed the charges.",
    "SubTitle":"DomesticAffairs / Edition #24",
    "PublicationWeek":"7/14/24 - 7/20/24"
    },
  {
    "NewsletterNumber":"25",
    "Cover":"https://th.bing.com/th/id/OIP.r7ctEsM4Q0TdJQyWvjKhnwAAAA?rs=1&pid=ImgDetMain",
    "Title":"KAMALA KARRIS",
    "Content":"Vice President Kamala Harris’ presidential campaign raised $200 million in just its first week of campaigning. The majority of the Democratic Party stands behind Harris, following Biden’s withdrawal from his re-election bid. In fact, the day after President Biden’s announcement, the campaign raked in more than $100 million. The Democratic Party will officially select its presidential nominee in August. VP Harris is expected to nominate her running mate soon.",
    "SubTitle":"DomesticAffairs / Edition #25",
    "PublicationWeek":"7/21/24 - 7/27/24"
    },
  {
    "NewsletterNumber":"26",
    "Cover":"https://th.bing.com/th/id/OIP.TpnHP6Knh5cPo9tLSALVJgHaEK?rs=1&pid=ImgDetMain",
    "Title":"9/11 Plotters",
    "Content":"Accused Set.11 Plotters Khalid Shaikh Mohammed, Walid bin Attash, and Mustafa al-Hawsawi have pleaded guilty to conspiracy and murder charges, sentenced to life imprisonment instead of the death penalty - a plea deal arranged by the Pentagon. However, U.S. Defense Secretary Lloyd Austin abruptly revoked the plea deal, reviving the death penalty as an option.",
    "SubTitle":"LawAndJustice / Edition #26",
    "PublicationWeek":"7/28/24 - 8/3/24"
    },
  {
    "NewsletterNumber":"28",
    "Cover":"https://scri.siena.edu/wp-content/uploads/2023/12/cover-5-640x437.jpg",
    "Title":"Polls",
    "Content":"According to new surveys conducted by the New York Times and Siena College, Vice President Harris currently leads Trump in three key states by four percentage points: Michigan, Pennsylvania, and Wisconsin. Note that the polls are changing invariably. Among recent national polls, VP Harris is in the lead, ahead of Trump by several points.",
    "SubTitle":"GlobalAffairs/ Edition #28",
    "PublicationWeek":"8/11/24 - 8/17/24"
    },
  {
    "NewsletterNumber":"29",
    "Cover":"https://scx2.b-cdn.net/gfx/news/hires/2020/nasacallfora.jpg",
    "Title":"NASA ASTRONAUTS",
    "Content":"In a week-long test flight turned into an eight-month-flight, Boeing Crew Flight Test astronauts Suni Williams and Butch Wilmore will have to wait until February 2025 to return to Earth. According to NASA, bringing the two astronauts back in a troubled new Boeing capsule poses too great of a risk; Williams and Wilmore will be riding home with SpaceX.",
    "SubTitle":"Environmental / Edition #29",
    "PublicationWeek":"8/18/24 - 8/24/24"
    },
  {
    "NewsletterNumber":"34",
    "Cover":"https://data.ddhq.io/election_center/thumbnails/Harris-Trump-General.jpg",
    "Title":"HARRIS AND TRUMP",
    "Content":"According to New York Times/Siena College polls, the race between Harris and Trump is extremely tight in battlegrounds Wisconsin and Michigan. Trump’s popularity among voters on economy, the most important voting issue in this election, seems to be chiseling Harris’s lead from early August. In Michigan, Harris and Trump are tied 48 to 47 percent, respectively; in Wisconsin, Harris and Trump are tied 49 to 47 percent, respectively.",
    "SubTitle":"DomesticAffairs / Edition #31",
    "PublicationWeek":"9/22/24 - 9/28/24"
    }


]