[{"NewsletterID":"1","Title":"66TH GRAMMY AWARDS","Content":"Miley Cyrus wins her first Grammy for Best Solo Pop Performance. SZA is the most nominated artist, with 9 grammy nominations. Billie Eilish & FINNEAS win Best Song for Visual Media (for their song, 'What Was I Made For?').Taylor Swift wins her 13th Grammy for Best Pop Vocal Album (for Midnights)","Cover":"","RelevantSources":"https://www.grammy.com/news/2024-grammys-nominations-full-winners-nominees-list","PublicationWeek":"2/4-2/10","NewsletterEdition":"1","Status":"archived"},{"NewsletterID":"2","Title":"CALIFORNIA STORM","Content":"An atmospheric river storm (usually formed when water vapors, typically from tropical regions, are carried by wind currents in the atmosphere) has ensued chaos in Southern California, with several feet of snowfall and life-threatening flooding to be expected. California has issued a state of emergency. Biden has promised aid to California.","Cover":"","RelevantSources":"https://www.nytimes.com/live/2024/02/05/us/weather-california-storm","PublicationWeek":"2/4-2/10","NewsletterEdition":"1","Status":"archived"},{"NewsletterID":"3","Title":"MAYORKAS IMPEACHMENT","Content":"This week, Republicans failed to impeach Alejandro N. Mayorkas, the U.S. secretary of homeland security, with a 214 - 216 loss. They argue that he has failed to enforce immigration laws, evidenced by an influx of illegal migrants flooding the U.S. and the insecurity of the southern border.","Cover":"","RelevantSources":"https://apnews.com/article/mayorkas-border-impeachment-immigration-d5f6a7d91ea725768e27b9b2bc5391a4","PublicationWeek":"2/4-2/10","NewsletterEdition":"1","Status":"archived"},{"NewsletterID":"4","Title":"SPECIAL COUNSEL REPORT ON BIDEN","Content":"President Biden’s declining mental acuity has raised concerns about his ability to run for a second term and to run the country, as a whole (according to a special counsel report). Though both Trump (77) and Biden (81) are both relatively old, people appear to be more concerned about Biden, rather than Trump, due to physical manifestations of aging (memory, his white hair, gaffes, falls).","Cover":"","RelevantSources":"https://www.nytimes.com/2024/02/08/us/politics/biden-special-counsel-report-documents.html","PublicationWeek":"2/4-2/10","NewsletterEdition":"1","Status":"archived"},{"NewsletterID":"5","Title":"KING CHARLES III","Content":"King Charles III has been diagnosed with cancer (type not disclosed). He is beginning treatments; accordingly, he has suspended public outings. However, on Sunday, 2/11, he made his first public outing, since the diagonsis, to attend church.","Cover":"","RelevantSources":"https://www.cnn.com/2024/02/11/europe/king-charles-public-cancer-diagnosis-intl-gbr/index.html","PublicationWeek":"2/4-2/10","NewsletterEdition":"1","Status":"archived"},{"NewsletterID":"6","Title":"ETHIOPIA","Content":"Ethiopian Prime Minister Abiy Ahmed denies famine deaths, despite reports of nearly 400 hunger-related fatalities in conflict-hit regions like Tigray. Concerns persist from organizations like the World Food Programme and the World Health Organization about severe conditions and limited access to food in affected areas.","Cover":"","RelevantSources":"https://abcnews.go.com/International/ethiopian-prime-minister-dismisses-reports-famine-deaths/story?id=107016186","PublicationWeek":"2/4-2/10","NewsletterEdition":"1","Status":"archived"},{"NewsletterID":"7","Title":"HAPPY LUNAR NEW YEAR'S!","Content":"Across the globe, millions celebrated Lunar New Year’s on February 10th, 2024, marking the arrival of spring and the year of the dragon. Celebration will last 15 days.","Cover":"","RelevantSources":"https://time.com/6693533/lunar-new-year-2024-asian-communities-global-celebrations/","PublicationWeek":"2/4-2/10","NewsletterEdition":"1","Status":"archived"},{"NewsletterID":"8","Title":"LIL BOO THANG","Content":"YOU A MY LIL' BOO THANG... TELL 'EM YOU FOUND A LIL' SOMETHING TOO FRESH","Cover":"","RelevantSources":"","PublicationWeek":"2/4-2/10","NewsletterEdition":"1","Status":"archived"},{"NewsletterID":"9","Title":"SUPER BOWL LVII","Content":"Super Bowl LVII mixed football with pop culture. Usher's halftime show dazzled despite glitches, Taylor Swift's return from Tokyo made headlines, and Beyoncé announced a new album in a Verizon ad.  Hollywood studios debuted trailers for highly anticipated films like Wicked and Twisters, alongside the unexpected delight of Kung Fu Panda 4.","Cover":"","RelevantSources":"https://www.npr.org/2024/02/12/1230835895/the-super-bowl-was-more-than-football-it-was-a-night-of-pop-culture","PublicationWeek":"2/11 - 2/17","NewsletterEdition":"2","Status":"archived"},{"NewsletterID":"10","Title":"FOREIGN AID BILL","Content":"In a 70 - 29 vote, the Senate passed a $95.3 billion bipartisan bill to aid Ukraine and Israel. The bill will be portioned out to provide military aid to Ukraine, security assistance for Israel, and financial assistance to U.S. regional Indo-Pacific partners. House Speaker Mike Johnson and former President Donald Trump have expressed their opposition to the bill due to absence of strong border provisions.","Cover":"","RelevantSources":"https://www.cnn.com/2024/02/12/politics/senate-foreign-aid-bill-ukraine/index.html","PublicationWeek":"2/11 - 2/17","NewsletterEdition":"2","Status":"archived"},{"NewsletterID":"11","Title":"MASS SHOOTING","Content":"A dispute at the Chiefs' Super Bowl celebration in Kansas City led to a mass shooting, leaving one dead and 22 injured, including children as young as 6. Two juveniles were detained, and several guns were recovered. The incident underscores ongoing concerns about gun violence, with nearly 5,000 lives lost to shootings in 2024.","Cover":"","RelevantSources":"https://abcnews.go.com/US/mass-shooting-kansas-city-chiefs-super-bowl-celebration-investigation/story?id=107254077","PublicationWeek":"2/11 - 2/17","NewsletterEdition":"2","Status":"archived"},{"NewsletterID":"12","Title":"CONGRESSIONAL ELECTION","Content":"In a heated congressional election to replace former GOP House Representative George Santos, expelled due to criminal charges, Democrat Tom Suozzi and Republican Mazi Pilip fought against each other in a special election. Suozzi won the special election, held in NY’s 3rd District, last Tuesday.","Cover":"","RelevantSources":"https://www.nbcnews.com/politics/2024-election/democrat-tom-suozzi-wins-ny-special-election-replace-george-santos-rcna138548","PublicationWeek":"2/11 - 2/17","NewsletterEdition":"2","Status":"archived"},{"NewsletterID":"13","Title":"TRUMP","Content":"On grounds of inflating his real estate properties, a New York Judge required former President Donald Trump to pay $453.5 million. His sons are also barred from ongoing business in New York State. In addition to paying $83 million for defaming to writer E. Jean Carroll, he now must pay a total fine of $536.8 million. The 2024 Republican Presidential Candidate has reasoned that the court decisions are “based on nothing other than having built a GREAT COMPANY,’ he wrote. ‘ELECTION INTERFERENCE. WITCH HUNT.’”","Cover":"","RelevantSources":"https://www.nytimes.com/2024/02/17/nyregion/trump-civil-cases-millions.html","PublicationWeek":"2/11 - 2/17","NewsletterEdition":"2","Status":"archived"},{"NewsletterID":"14","Title":"ALEKSEI NAVALNY","Content":"Aleksei A. Navalny, an avid and vocal critic of President Vladimir Putin, died in a Russian prison on Friday. He was 47. Cause of his death is unknown. He was frequently assaulted, arrested, jailed for rallying political opposition to Putin. Yulia Navalnaya, Navalny’s wife, has publicly vowed to continue her husband's work.","Cover":"","RelevantSources":"https://www.nytimes.com/spotlight/aleksei-navalny","PublicationWeek":"2/11 - 2/17","NewsletterEdition":"2","Status":"archived"},{"NewsletterID":"15","Title":"MAYORKAS IMPEACHMENT","Content":"Last week, Republicans failed to impeach Alejandro N. Mayorkas, the U.S. secretary of homeland security on the grounds of failure to secure the U.S. border. This week, with a 214 - 213 narrow Republican win, Mayorkas is the first sitting cabinet secretary to be impeached.","Cover":"","RelevantSources":"https://www.cnn.com/2024/02/13/politics/alejandro-mayorkas-impeachment-vote/index.html","PublicationWeek":"2/11 - 2/17","NewsletterEdition":"2","Status":"archived"},{"NewsletterID":"16","Title":"PINK + WHITE","Content":"“That’s why everyday goes every time we have no control if the sky is pink and white”","Cover":"","RelevantSources":"","PublicationWeek":"2/11 - 2/17","NewsletterEdition":"2","Status":"archived"},{"NewsletterID":"17","Title":"MADAME WEB","Content":"Negative reviews flood in for Sony’s latest addition to the Spider-Man franchise, “Madame Web”, starring Dakota Johnson. The box office ratings are among the lowest ticket sales ever for a superhero movie.","Cover":"","RelevantSources":"https://www.nytimes.com/2024/02/22/style/madame-web-memes-box-office.html","PublicationWeek":"2/18 - 2/24","NewsletterEdition":"3","Status":"archived"},{"NewsletterID":"18","Title":"ALEKSEI NAVALNY","Content":"Following Alexei A. Navalny’s death (see Newsletter #2 for more information), the Biden administration has been preparing a package of sanctions (economic punishments) against Moscow. President Biden affirms that Putin and the Russian government are undoubtedly liable for Navalny’s death. Previous U.S. sanctions, however, have not been quite successful; in fact, the Russian economy is currently growing - and fast.","Cover":"","RelevantSources":"https://www.nytimes.com/spotlight/aleksei-navalny","PublicationWeek":"2/18 - 2/24","NewsletterEdition":"3","Status":"archived"},{"NewsletterID":"19","Title":"SOUTH CAROLINA GOP PRIMARY","Content":"Last Saturday, Donald Trump won the South Carolina GOP Primary (a primary is an election within a political party to determine the party’s nominee preference), beating former South Carolina governor and U.N. ambassador Nikki Haley. Many believe that Trump has already secured the GOP presidential nomination, casting further doubt on the long-term viability of Haley’s presidential campaign. A rematch between Trump and Biden is increasingly likely.","Cover":"","RelevantSources":"https://www.cnn.com/politics/live-news/south-carolina-primary-02-24-24/index.html","PublicationWeek":"2/18 - 2/24","NewsletterEdition":"3","Status":"archived"},{"NewsletterID":"20","Title":"ALABAMA EMBYRO RULING","Content":"On Wednesday, the Supreme Court of Alabama ruled that frozen embryos (in test tubes) are recognized as children. Subsequently, the University of Alabama at Birmingham Hospital paused in vitro fertilization treatments (fertilizing eggs with sperm to create an embryo). In Mobile, Alabama, in a fertility clinic with an “unsecured doorway”, a hospital patient had dropped several frozen embryos (killing them, per the ruling).","Cover":"","RelevantSources":"https://www.cnn.com/2024/02/20/us/alabama-embryo-law-ruling-supreme-court/index.html","PublicationWeek":"2/18 - 2/24","NewsletterEdition":"3","Status":"archived"},{"NewsletterID":"21","Title":"ODIE","Content":"2/12/24 marks the first time in 51 years that a U.S.-made spacecraft landed on the moon. “Odie”, otherwise known as the Odyssey lunar lander, is the first spacecraft ever to be built by a company in the private sector - Intuitive Machines. The lander is beginning to send data back to Earth.","Cover":"","RelevantSources":"https://www.cnn.com/us/live-news/nasa-odysseus-moon-landing-intuitive-machines-scn/index.html","PublicationWeek":"2/18 - 2/24","NewsletterEdition":"3","Status":"archived"},{"NewsletterID":"22","Title":"PAKISTAN","Content":"A senior Pakistani official admitted to manipulating election results, fueling concerns of widespread fraud. The Election Commission of Pakistan ordered an investigation, while the Human Rights Commission raised doubts about the election's credibility. The official’s admission has raised questions about electoral integrity and the legitimacy of the election outcomes.","Cover":"","RelevantSources":"https://www.nytimes.com/2024/02/18/world/asia/pakistan-election.html","PublicationWeek":"2/18 - 2/24","NewsletterEdition":"3","Status":"archived"},{"NewsletterID":"23","Title":"AVDIIVKA","Content":"Avdiivka, a longstanding Ukrainian stronghold, falls to Russian forces as Ukraine's military retreats to avoid encirclement. Soldiers describe chaotic withdrawal amid heavy bombardment, marking a significant gain for Russia in the ongoing conflict.","Cover":"","RelevantSources":"https://www.nytimes.com/2024/02/17/world/europe/ukraine-avdiivka-withdraw-despair.html","PublicationWeek":"2/18 - 2/24","NewsletterEdition":"3","Status":"archived"},{"NewsletterID":"24","Title":"2024 PEOPLE'S CHOICE AWARDS","Content":"The 2024 People's Choice Awards saw big wins for Barbie, Taylor Swift, and Travis Kelce. Adam Sandler humorously accepted the People’s Icon Award, while Billie Eilish debuted her return to black hair roots. Natasha Bedingfield shared the inspiration behind Unwritten, and Jeremy Renner received a standing applause.","Cover":"","RelevantSources":"https://www.today.com/popculture/awards/live-blog/peoples-choice-awards-live-updates-rcna139201","PublicationWeek":"2/18 - 2/24","NewsletterEdition":"3","Status":"archived"},{"NewsletterID":"25","Title":"KILL BILL","Content":"“I'm so mature, I'm so mature... I might kill my ex, not the best idea His new girlfriend's next, how'd I get here?”","Cover":"","RelevantSources":"","PublicationWeek":"2/18 - 2/24","NewsletterEdition":"3","Status":"archived"},{"NewsletterID":"26","Title":"ΚΕΝΝΕΤΗ MITCHELL","Content":"Kenneth Mitchell, known for his roles in “Star Trek: Discovery” and “Captain Marvel,” passed away at 49 after battling ALS disease (a neurodegenerative disease that affects nerve cells & motor skills) for 5.5 years. His family announced his death, praising his resilience and positive outlook. Mitchell’s notable commitments to ALS research left a lasting impact, with fans and colleagues mourning his loss.","Cover":"","RelevantSources":"https://www.nbcnews.com/news/obituaries/kenneth-mitchell-star-trek-discovery-captain-marvel-actor-dies-49-als-rcna140417","PublicationWeek":"2/25-3/2","NewsletterEdition":"4","Status":"archived"},{"NewsletterID":"27","Title":"GOVERNMENT SHUTDOWN","Content":"As a partial government shutdown (occurs when Congress does not pass all 12 bills that fund the gov, and non-essential federal agencies are not paid) approaches soon, President Biden met with the top four congressional leaders to strike a deal to avoid a government shutdown. Biden, however, has requested billions of dollars for foreign military aid for Ukraine and Israel (see Newsletter #2). According to his White House press secretary Karine Jean-Pierre, the Biden Administration intends to keep the government open.","Cover":"","RelevantSources":"https://www.cnbc.com/2024/03/03/congress-unveils-first-six-budget-bills-to-avert-government-shutdown.html","PublicationWeek":"2/25-3/2","NewsletterEdition":"4","Status":"archived"},{"NewsletterID":"28","Title":"AARON BUSHNELL","Content":"US air force member Aaron Bushnell, 25, dies outside of the Israeli Embassy in Washington after lighting himself on fire as an act of protest against the ongoing Israeli-Gaza conflict. Mr. Bushnell livestreamed the protest on social media platform Twitch.","Cover":"","RelevantSources":"https://www.nytimes.com/2024/02/25/world/middleeast/israel-embassy-man-on-fire.html","PublicationWeek":"2/25-3/2","NewsletterEdition":"4","Status":"archived"},{"NewsletterID":"29","Title":"1 BILLION DONATION","Content":"Ruth Gottesman, a former professor at Albert Einstein College of Medicine, donated $1 billion to the Bronx school to cover all students’ tuition. The money came from her late husband, David Gottesman, who was an early investor in Berkshire Hathaway.","Cover":"","RelevantSources":"https://www.nytimes.com/2024/02/26/nyregion/albert-einstein-college-medicine-bronx-donation.html","PublicationWeek":"2/25-3/2","NewsletterEdition":"4","Status":"archived"},{"NewsletterID":"30","Title":"FIRST COPY OF HARRY POTTER NOVEL","Content":"A proof copy of the first Harry Potter novel, bought for pennies in 1997, sold at auction for £11,000 ($13,900). Originally purchased for 40 pence ($0.50), the seller didn't realize its value until learning about high prices for similar copies online. This rare find, labeled an uncorrected proof copy, marks the beginning of the Harry Potter phenomenon, with the author's name mistakenly listed as J A Rowling instead of J.K. Rowling.","Cover":"","RelevantSources":"https://apnews.com/article/harry-potter-book-auction-dacbae821f3a31a7fd9d3e3276d06850","PublicationWeek":"2/25-3/2","NewsletterEdition":"4","Status":"archived"},{"NewsletterID":"31","Title":"ISRAEL-HAMAS CONFLICT","Content":"The UN warns that over 570,000 people in Gaza face famine amid the Israel-Hamas conflict, with one in six young children suffering from malnutrition. Restrictions on goods worsen the crisis, leading to potential agricultural collapse by May. Humanitarian aid struggles to reach those in need, and casualties on both sides continue to rise since the conflict began in October 2023.","Cover":"","RelevantSources":"https://abcnews.go.com/International/half-million-people-gaza-one-step-from-famine-un-official/story?id=107630405","PublicationWeek":"2/25-3/2","NewsletterEdition":"4","Status":"archived"},{"NewsletterID":"32","Title":"MAYORKAS IMPEACHMENT","Content":"Last week, Republicans failed to impeach Alejandro N. Mayorkas, the U.S. secretary of homeland security on the grounds of failure to secure the U.S. border. This week, with a 214 - 213 narrow Republican win, Mayorkas is the first sitting cabinet secretary to be impeached.","Cover":"","RelevantSources":"","PublicationWeek":"","NewsletterEdition":"4","Status":"archived"},{"NewsletterID":"33","Title":"PINK + WHITE","Content":"“That’s why everyday goes every time we have no control if the sky is pink and white”","Cover":"","RelevantSources":"","PublicationWeek":"","NewsletterEdition":"","Status":""},{"NewsletterID":"34","Title":"MIKE TYSON","Content":"At age 58, former heavyweight champion Mike Tyson will be getting back in the boxing ring against Jake Paul, the influncer turned boxer. Their match will be streamed live on Netflix on July 20th of this year, in the company’s attempt to push into “sports-adjacent programming,” which has the potential of drawing more people without crazy investments.","Cover":"","RelevantSources":"https://www.nytimes.com/2024/03/07/business/media/mike-tyson-jake-paul-fight-netflix.html","PublicationWeek":"3/3-3/9","NewsletterEdition":"5","Status":"archived"},{"NewsletterID":"35","Title":"NIGERIA","Content":"Gunmen attacked a school in Nigeria's northwest, abducting 287 students. This marks the second mass abduction in less than a week, highlighting ongoing security challenges in the country.","Cover":"","RelevantSources":"https://abcnews.go.com/International/wireStory/100-pupils-abducted-gunmen-fresh-school-attack-nigerias-107893672","PublicationWeek":"3/3-3/9","NewsletterEdition":"5","Status":"archived"},{"NewsletterID":"36","Title":"STATE OF THE UNION ADDRESS","Content":"Last Thursday, Biden gave his State of the Union Address (a constitutionally mandated, annual address before the members of Congress). He criticized his predecessor (Trump) multiple times throughout the speech. Biden also covered several key wedge issues (abortion, economy, border, Israel-Palestine war). Representative Majorie Taylor Greene heckled during the address, demanding Biden to say Riley Laken’s name (a 22-years old nursing student killed by an illegal immigrant).","Cover":"","RelevantSources":"https://www.cnn.com/politics/live-news/state-of-the-union-biden-03-07-24/index.html","PublicationWeek":"3/3-3/9","NewsletterEdition":"5","Status":"archived"},{"NewsletterID":"37","Title":"SUPER TUESDAY RESULTS","Content":"On March 5th, the 2024 Super Tuesday primary contests were held, with current President Biden and former president Trump sweeping primaries all over the country. Last week, Nikki Haley dropped out of the presidential race, having won only one primary in the Super Tuesday Contests.","Cover":"","RelevantSources":"https://apnews.com/article/super-tuesday-trump-biden-rematch-primaries-2024-e36971a222a2b50d35cb0a2c603ce4d5","PublicationWeek":"3/3-3/9","NewsletterEdition":"5","Status":"archived"},{"NewsletterID":"38","Title":"CHINA","Content":"With the birth rate decreasing in China, the country is now advocating for couples to have children. Following the former One-Child Policy in China which ended in January 2016, the propaganda effort was met with ridicule, following forced abortions and claims that “having more babies would hinder China’s modernization”.","Cover":"","RelevantSources":"https://www.nytimes.com/interactive/2024/03/09/world/asia/china-childbirth-propaganda.html","PublicationWeek":"3/3-3/9","NewsletterEdition":"5","Status":"archived"},{"NewsletterID":"39","Title":"TURKEY","Content":"Thousands of women took to the streets in Istanbul, Turkey, demanding change for women on International Women’s Day. Turkey became the first country to adopt the Istanbul Convention in March 2012, which combats gender-based violence by establishing legally binding requirements for protecting victims and punishing abusers. In 2021, President Recep Tayyip Erdoğan's Islamic administration withdrew from the convention, citing concerns that it undermined conservative values.","Cover":"","RelevantSources":"https://abcnews.go.com/International/thousands-turkish-women-defy-ban-protest-equal-rights/story?id=107937682","PublicationWeek":"3/3-3/9","NewsletterEdition":"5","Status":"archived"},{"NewsletterID":"40","Title":"NATO","Content":"NATO conducts its largest drills since the Cold War in northern Norway to prepare troops and send a message to Russia. Exercises involve tracking simulated enemy submarines, showcasing NATO's defense readiness.","Cover":"","RelevantSources":"https://abcnews.go.com/International/wireStory/french-frigate-destroys-german-norways-waters-natos-biggest-107961422","PublicationWeek":"3/3-3/9","NewsletterEdition":"5","Status":"archived"},{"NewsletterID":"41","Title":"I WROTE THIS SONG","Content":"“i LOVE MY BABY SO, BUT HE’S NOT HERE NO MORE. HARD FOR ME TO UNDERSTAND, SO I WROTE HIM THIS SONG.”","Cover":"","RelevantSources":"","PublicationWeek":"3/3-3/9","NewsletterEdition":"5","Status":"archived"},{"NewsletterID":"42","Title":"KATE MIDDLETON","Content":"Kate Middleton's controversial family photo was edited twice in Adobe Photoshop on March 8 and March 9. The photo, later retracted by news agencies, raised concerns about manipulation, particularly regarding Princess Charlotte's hand alignment, leading to Kate's apology.","Cover":"","RelevantSources":"https://abcnews.go.com/culture/story/kate-middleton-photo-controversy-new-details-show-photo/?id=108123599?amp_gsa=1&amp_js_v=a9&id=108123599&usqp=mq331AQIUAKwASCAAgM=","PublicationWeek":"3/10-3/16","NewsletterEdition":"6","Status":"archived"},{"NewsletterID":"43","Title":"TIK TOK","Content":"Last Wednesday, the House passed a bill to ban TikTok nationwide. With more than 170 million users, TikTok is owned by a Chinese technology firm - ByteDance. Lawmakers are concerned that the Chinese government will be able to extract data from TikTok consumers, particular those in the U.S., and surveil on American citizens. It has yet to be passed in the Senate. Biden promises to sign the legislation if passed by Congress.","Cover":"","RelevantSources":"https://apnews.com/article/tiktok-ban-house-vote-china-national-security-8fa7258fae1a4902d344c9d978d58a37","PublicationWeek":"3/10-3/16","NewsletterEdition":"6","Status":"archived"},{"NewsletterID":"44","Title":"PARTY NOMINATIONS","Content":"Last Tuesday, Incumbent (current) president Biden secured the majority of delegates and, subsequently, the Democratic nomination. Former president Trump also secured the Republican nomination. According to an Associated Press report, Biden’s approval rate is currently 38%, with 61% expressing disapproval at his performance. A Biden-Trump rematch will definitively happen in November.","Cover":"","RelevantSources":"https://apnews.com/article/trump-biden-primary-georgia-washington-mississippi-hawaii-15bb0084ad656903ffef14cfae822abd","PublicationWeek":"3/10-3/16","NewsletterEdition":"6","Status":"archived"},{"NewsletterID":"45","Title":"NORTH KOREA","Content":"North Korean leader Kim Jong Un joins troops in training with newly developed battle tanks. In response to ongoing South Korean-U.S. military drills, which North Korea perceives as preparation for invasion, the activities, including the operation of advanced main battle tanks, serve as a direct response.","Cover":"","RelevantSources":"","PublicationWeek":"3/10-3/16","NewsletterEdition":"6","Status":"archived"},{"NewsletterID":"46","Title":"PAUL ALEXANDER","Content":"Last Monday, TikTok famous star, lawyer, and author Paul Alexander died at the age of 78. Diagnosed with polio at the age of 6, Alexander’s body was paralyzed from the neck down. For over 70 years, his life was sustained by an iron lung. Known as “Polio Paul” on TikTok, he is the longest surviving iron lung patient in the world. Refusing to be defined by just his medical condition, Alexander lived an incredible and accomplished life.","Cover":"","RelevantSources":"https://www.cnn.com/2024/03/13/health/paul-alexander-polio-iron-lung/index.html","PublicationWeek":"3/10-3/16","NewsletterEdition":"6","Status":"archived"},{"NewsletterID":"47","Title":"FRANCE ON FAST FASHION","Content":"France's Parliament passed a groundbreaking bill to address fast fashion's environmental impact, targeting ads for cheap textiles and imposing levies on low-cost products. The focus is on promoting transparency and sustainable practices among fashion giants.","Cover":"","RelevantSources":"https://abcnews.go.com/International/wireStory/pioneering-bill-slow-fast-fashion-gets-approval-french-108156283","PublicationWeek":"3/10-3/16","NewsletterEdition":"6","Status":"archived"},{"NewsletterID":"48","Title":"SUMATRA","Content":"Flash floods and landslides in West Sumatra, Indonesia, killed 26 people and left 11 missing. Torrential rains submerged nine districts, causing a major mudslide in Pesisir Selatan district, hampering rescue efforts.","Cover":"","RelevantSources":"","PublicationWeek":"3/10-3/16","NewsletterEdition":"6","Status":"archived"},{"NewsletterID":"49","Title":"SATURN BY SZA","Content":"“SICK OF THIS HEAD OF MINE INTRUSIVE THOUGHTS, THEY PARALYZE NIRVANA’S NOT AS ADVERTISED”","Cover":"","RelevantSources":"","PublicationWeek":"3/10-3/16","NewsletterEdition":"6","Status":"archived"},{"NewsletterID":"50","Title":"KATE MIDDLETON","Content":"Princess Kate, formerly Kate Middleton, revealed that she is currently undergoing preventative chemotherapy, after cancer was discovered in her abdominal surgery earlier this year. The type of cancer has not been specified.","Cover":"","RelevantSources":"https://www.cbsnews.com/news/princess-kate-cancer-diagnosis-what-we-know/","PublicationWeek":"3/17-3/23","NewsletterEdition":"7","Status":"archived"},{"NewsletterID":"51","Title":"TEXAS","Content":"As per a 6-3 Supreme Court decision, Texas has been granted the authority to detain and arrest migrants crossing the border illegally. The three liberal judges on the court dissented to the controversial Texas law. With the ongoing battle between Texas and the Biden Administration over immigration on the Southern border, the decision hands a temporary win to Texas.","Cover":"","RelevantSources":"https://amp.cnn.com/cnn/2024/03/19/politics/supreme-court-allows-texas-to-begin-enforcing-controversial-immigration-law","PublicationWeek":"3/17-3/23","NewsletterEdition":"7","Status":"archived"},{"NewsletterID":"52","Title":"PUTIN","Content":"Russian President Vladmir Putin won the 2024 Russian presidential election, leading with 87.3% of the vote. Putin may be in office until 2036, and will be the longest-serving President since Joseph Stalin. Putin recently acknowledged Alexei Navalny’s death in an evening address (see Newsletter #3).","Cover":"","RelevantSources":"https://www.cnn.com/2024/03/17/europe/putin-wins-russia-presidential-election-intl/index.html","PublicationWeek":"3/17-3/23","NewsletterEdition":"7","Status":"archived"},{"NewsletterID":"53","Title":"ARIANA GRANDE","Content":"Ariana Grande's latest album Eternal Sunshine debuts at No. 1 on the Billboard chart with 227,000 equivalent sales in the United States. This marks Grande's sixth No. 1 album and is the biggest debut of the year so far, surpassing other recent releases like Ye and Ty Dolla Sign's Vultures 1.”","Cover":"","RelevantSources":"https://www.nytimes.com/2024/03/18/arts/music/ariana-grande-eternal-sunshine-billboard-chart.html","PublicationWeek":"3/17-3/23","NewsletterEdition":"7","Status":"archived"},{"NewsletterID":"54","Title":"SENATOR MENENDEZ","Content":"Last Thursday, Senator Bob Menendez, a Democrat from New Jersey, announced that he would not be seeking re-election as a Democrat, but rather as an Independent Democrat. On Twitter, he has expressed his hopes to be exonerated of ongoing corruption charges (for accepting bribes) over the summer to be able to run in a general election.","Cover":"","RelevantSources":"https://www.npr.org/2024/03/21/1240044252/robert-menendez-reelection","PublicationWeek":"3/17-3/23","NewsletterEdition":"7","Status":"archived"},{"NewsletterID":"55","Title":"RUSSIA","Content":"According to the Russian Foreign Security Service, at least 40 people were killed and over 100 injured in a shooting and explosion at Moscow's Crocus City Hall, one of Russia's largest shopping and entertainment complexes, on Friday evening. Russia's foreign ministry described the shooting and explosion as a terrorist attack. Several shooters entered into the music hall and opened fire with automatic rifles and fired a grenade/incendiary bomb, which started a fire in the hall.","Cover":"","RelevantSources":"https://abcnews.go.com/International/shooting-reported-concert-hall-moscow/story?id=108396308","PublicationWeek":"3/17-3/23","NewsletterEdition":"7","Status":"archived"},{"NewsletterID":"56","Title":"FUNDING PACKAGE","Content":"Last Saturday, Biden signed a $1.2 trillion dollar funding package that will fund the government until October 1st, barely avoiding a partial government shutdown (see Newsletter #4). House Republicans held a press conference, condemning the spending package; during the conference, Georgia Representative Majorie Taylor Green (R) filed a motion to remove Speaker Mike Johnson from his position as the Speaker of the House.","Cover":"","RelevantSources":"https://www.cnbc.com/2024/03/23/biden-signs-1point2-trillion-spending-package.html","PublicationWeek":"3/17-3/23","NewsletterEdition":"7","Status":"archived"},{"NewsletterID":"57","Title":"APPLE","Content":"Last Friday, the U.S. Department of Justice sued Apple, accusing the trillion-dollar tech giant of forming an illegal monopoly in the iPhone industry. With 16 general attorneys filing the lawsuit, the DOJ alleged that Apple, in controlling and regulating the smartphone market, subsequently controls consumer fixation - a fixation that has latched onto Apple products. This monopoly has blown away competition and hindered innovation in this particular market.","Cover":"","RelevantSources":"https://apnews.com/article/apple-antitrust-monopoly-app-store-justice-department-822d7e8f5cf53a2636795fcc33ee1fc3","PublicationWeek":"3/17-3/23","NewsletterEdition":"7","Status":"archived"},{"NewsletterID":"58","Title":"TRAINING SEASON","Content":"“I NEED SOMEONE TO HOLD ME CLOSE, DEEPER THAN I’VE EVER KNOWN WHOSE LOVE IS LIKE RODEO”","Cover":"","RelevantSources":"","PublicationWeek":"3/17-3/23","NewsletterEdition":"7","Status":"archived"},{"NewsletterID":"59","Title":"DOCUMENTARY","Content":"The Quiet on Set: The Dark Side of Kids TV documentary gains more traction as events behind the scenes become publicly exposed. The series focuses on prolific TV creator Dan Schneider and his abuse of power, the multiple convicted pedophiles who worked on his hit Nickelodeon shows, and interviews with former child actors, parents, and crew members.","Cover":"","RelevantSources":"https://www.latimes.com/entertainment-arts/tv/story/2024-03-13/quiet-on-the-set-documentary-nickelodeon","PublicationWeek":"3/24-3/30","NewsletterEdition":"8","Status":"archived"},{"NewsletterID":"60","Title":"TEXAS LAW","Content":"As per two rulings from the 5th U.S. Circuit Court of Appeals, the Texas Law that granted permission for police to arrest migrants crossing the border illegally - a law lasting only several hours (check previous Newsletter) - has been put on hold, until a new court ruling determines whether the law is legal or not.","Cover":"","RelevantSources":"https://apnews.com/article/texas-migrant-arrest-law-court-blocked-f4b568e0e940b906f5c06943ac797f97","PublicationWeek":"3/24-3/30","NewsletterEdition":"8","Status":"archived"},{"NewsletterID":"61","Title":"BALTIMORE KEY BRIDGE COLLAPSE","Content":"Last Tuesday, the massive cargo ship Dali crashed into the Baltimore Key Bridge, subsequently causing the bridge to collapse. People and cars were plunged into the Patapsco River. Of 8 construction workers, who were working on the bridge at the time of the collapse, two workers were rescued, the bodies of two killed workers were recovered on Wednesday and the bodies of the other four workers, presmued dead, are yet to be found.","Cover":"","RelevantSources":"https://www.cnn.com/2024/03/26/us/baltimore-bridge-collapse-what-we-know/index.html","PublicationWeek":"3/24-3/30","NewsletterEdition":"8","Status":"archived"},{"NewsletterID":"62","Title":"AMIT SOUSSANA","Content":"Amit Soussana, an Israeli woman, revealed the horrific details of her 55-day captivity by Hamas, including being sexually assaulted and subjected to violence after the October 7 attack. - As the first hostage to publicly testify, Soussana shed light on the ongoing issue of sexual violence and abuse faced by hostages in Gaza, sparking calls for action and condemnation from global leaders and organizations.","Cover":"","RelevantSources":"https://www.cnn.com/2024/03/26/middleeast/amit-soussana-israeli-hostage-hamas-sexual-assault-intl/index.html","PublicationWeek":"3/24-3/30","NewsletterEdition":"8","Status":"archived"},{"NewsletterID":"63","Title":"ISIS-K","Content":"The attacks of ISIS-K, a terror group branching out from ISIS, have recently gotten bolder and expanded beyond Afghanistan's borders. In recent months, ISIS-K has vowed to attack the Chinese, Indian, and Iranian embassies in Afghanistan. They have also unleashed a barrage of anti-Russian propaganda, blasting the Taliban for its coopoeration with the Kremlin. Now, US officials claim ISIS-K was responsible for the attack in Moscow’s Concert Hall (see Newsletter #7).","Cover":"","RelevantSources":"https://www.nytimes.com/2024/03/24/world/europe/isis-k-moscow-attack.html","PublicationWeek":"3/24-3/30","NewsletterEdition":"8","Status":"archived"},{"NewsletterID":"64","Title":"ABORTION PILL","Content":"The Supreme Court will decide public accessibility to Mifepristone, one of the two most frequently used abortion pills. The Alliance for Hippocratic Medicine alleged that the U.S. Food and Drug Administration, in making mifepristone easily accessible, failed to consider potential safety hazards associated with the pill. Based on the arguments exchanged between the plaintiff and the defendant, the Supreme Court justices seems inclined to rule in favor of the FDA. As of now, it seems that mifepristone will remain accessible.","Cover":"","RelevantSources":"https://www.cbsnews.com/news/supreme-court-abortion-pill-arguments-mifepristone/","PublicationWeek":"3/24-3/30","NewsletterEdition":"8","Status":"archived"},{"NewsletterID":"65","Title":"LOSE CONTROL","Content":"“I LOSE CONTROL WHEN YOU’RE NOT NEXT TO ME I’M FALLING APART RIGHT IN FRONT OF YOU”","Cover":"","RelevantSources":"","PublicationWeek":"3/24-3/30","NewsletterEdition":"8","Status":"archived"},{"NewsletterID":"66","Title":"$30 MILLION HEIST","Content":"On Easter Day, Sunday night, one of the largest cash heists in the history of Los Angeles occurred, with a group of thieves stealing as much as $30 million dollars from an L.A. money storage facility - a facility used to store cash from businesses around the region. Baffled, the police and L.A. detectives have not been able to find the burglars yet.","Cover":"","RelevantSources":"https://abcnews.go.com/US/wireStory/burglars-steal-30-million-cash-los-angeles-money-108823966","PublicationWeek":"3/31-4/6","NewsletterEdition":"9","Status":"archived"},{"NewsletterID":"67","Title":"TAIWAN EARTHQUAKE","Content":"Taiwan's strongest earthquake in 25 years, a 7.4-magnitude tremor, struck near Hualien City, resulting in at least nine deaths and over a thousand injuries. 100,000 buildings are either partially or completely collapsed. The disaster response center has been activated, and the National Army is providing support, with ongoing efforts to assess the damage and assist those affected.","Cover":"","RelevantSources":"https://www.nbcnews.com/news/world/earthquake-taiwan-tsunami-rcna146140","PublicationWeek":"3/31-4/6","NewsletterEdition":"9","Status":"archived"},{"NewsletterID":"68","Title":"U.S. EARTHQUAKE","Content":"With a magnitude of 4.8, an earthquake hit New Jersey, rattling the entire east coast. Over 42 million people, ranging from New York to Boston, felt the quake. There have been no major safety or infrastructure concerns, though minor cracks in buildings have been found. Seismologists predict that there will be aftershocks the week following the initial earthquake (several have actually taken place in NJ).","Cover":"","RelevantSources":"https://apnews.com/live/earthquake-new-york-updates","PublicationWeek":"3/31-4/6","NewsletterEdition":"9","Status":"archived"},{"NewsletterID":"69","Title":"TOTAL ECLIPSE","Content":"Today, April 8th, 2024, a total solar eclipse will appear, crossing over Mexico, the U.S., and Canada. This will be the last total solar eclipse in the U.S. until August 2044, 20 years from now. Severe storms and clouds may obscure the sky for eclipse tourists (millions have flocked to the east coast to watch the event), but tourists hope that the weather will cooperate. Wishing everyone a fun eclipse!","Cover":"","RelevantSources":"https://www.cnn.com/world/live-news/total-solar-eclipse-04-07-24-scn/index.html?tab=all","PublicationWeek":"3/31-4/6","NewsletterEdition":"9","Status":"archived"},{"NewsletterID":"70","Title":"CONGO","Content":"Judith Suminwa Tuluka has been appointed as Congo's first female prime minister by President Felix Tshisekedi. Escalating violence in the east of Congo, involving armed groups fighting for territory and alleged external support, raises international concerns and prompts calls for de-escalation, given that almost a million people have now been displaced.","Cover":"","RelevantSources":"https://abcnews.go.com/International/wireStory/congo-appoints-female-prime-minister-violence-surges-east-108725142","PublicationWeek":"3/31-4/6","NewsletterEdition":"9","Status":"archived"},{"NewsletterID":"71","Title":"FLORIDA","Content":"Last Monday, the Florida Supreme Court upheld the state’s 6-week abortion ban, with a 6-1 decision. However, the court, with a 4-3 decision, allowed a ballot measure for voters to enshrine the right to abortion in the state constitution. Planned Parenthood, the American Civil Liberties Union, and other pro-abortion organizations contested the ban in court on the grounds of the privacy clause - a controversial clause in the Florida Constitution.","Cover":"","RelevantSources":"https://apnews.com/article/florida-abortion-ban-supreme-court-ruling-6a4949fc7459afe9b5e298086a793126#:~:text=April%201%2C%202024-,TALLAHASSEE%2C%20Fla.,to%20remove%20restrictions%20in%20November.","PublicationWeek":"3/31-4/6","NewsletterEdition":"9","Status":"archived"},{"NewsletterID":"72","Title":"BALTIMORE KEY BRIDGE","Content":"After the collapse of the Baltimore Key Bridge (see Newsletter #8), Baltimore Mayor Brandon Scott (D) faces anti DEI (diversity, equity, and inclusion) sentiments from the right. Conservatives have blamed the collapse on D.E.I. policies. Biden toured the collapse site and greeted the families of collapse victims on Friday; he also pledged support in its re-construction. The removal of the collapse wreckage has started, but, given that the Baltimore Key Bridge is one of the main shipping lanes of the nation, recovery efforts are expected to be convoluted and costly.","Cover":"","RelevantSources":"https://www.nbcnews.com/news/nbcblk/utah-lawmaker-blames-diversity-baltimore-bridge-collapse-rcna145261","PublicationWeek":"3/31-4/6","NewsletterEdition":"9","Status":"archived"},{"NewsletterID":"73","Title":"TOO SWEET - HOZIER","Content":"“I think I'll take my whiskey neat My coffee black and my bed at three You're too sweet for me”","Cover":"","RelevantSources":"","PublicationWeek":"3/31-4/6","NewsletterEdition":"9","Status":"archived"},{"NewsletterID":"74","Title":"O.J. SIMPSON","Content":"O.J. Simpson, former football player who was acquitted of killing his ex-wife and her friend in 1994, died at age 76. On April 10th, Simpson succumbed to his battle with cancer.","Cover":"","RelevantSources":"https://abcnews.go.com/US/oj-simpson-former-football-star-acquitted-murder-dies/story?id=16354000","PublicationWeek":"4/7-4/13","NewsletterEdition":"10","Status":"archived"},{"NewsletterID":"75","Title":"TOTAL ECLIPSE","Content":"Last Sunday, a total eclipse, when the moon blocks the sun entirely, occurred from coast-to-coast in the U.S. From Texas to Maine, the path of totality spanned 115 miles wide. The next total solar eclipse that will occur in North America will be around 2044.","Cover":"","RelevantSources":"https://apnews.com/article/2024-total-solar-eclipse-photos-us-0a07725f59906849b00949e43177e6d9","PublicationWeek":"4/7-4/13","NewsletterEdition":"10","Status":"archived"},{"NewsletterID":"76","Title":"NICARAGUA","Content":"Nicaragua, a longtime supporter of the Palestinian cause, is widening the legal battle over the Gaza conflict at the International Court of Justice (UN), after filing a complaint against Germany, a key arms supplier to Israel. Nicaragua said in the hearings, last Monday, that Germany is aiding genocide in Gaza and violating the Genocide Convention in giving military aid to Israel.","Cover":"","RelevantSources":"https://www.nytimes.com/2024/04/08/world/middleeast/nicaragua-germany-world-court-israel-arms.html","PublicationWeek":"4/7-4/13","NewsletterEdition":"10","Status":"archived"},{"NewsletterID":"77","Title":"IRAN","Content":"Iran launched its first direct military attack on Israel on Saturday. According to the Israeli military, Iran shot over 100 bomb-carrying drones at Israel. Hours later, Iran announced the launch of lethal ballistic missiles and cruise missiles, after threatening to attack Israel following an airstrike earlier this week.","Cover":"","RelevantSources":"https://abcnews.go.com/International/wireStory/latest-iran-launches-full-scale-military-attack-israel-109208274","PublicationWeek":"4/7-4/13","NewsletterEdition":"10","Status":"archived"},{"NewsletterID":"78","Title":"STANDARDIZED TESTING","Content":"Prestigious colleges Harvard and Caltech will require applicants to submit their SAT or ACT scores for admission. Similarly, Dartmouth, Yale, MIT, Brown, and other colleges have also reversed their test-optional policies. The test-optional policies were initially thought to encourage low-performing, poor and underrepresented students, but with potential, to apply. Proponents of the tests, however, have argued that it is difficult to identify outperforming students without the standardized exam, being a national benchmark.","Cover":"","RelevantSources":"https://www.nytimes.com/2024/04/11/us/harvard-test-scores-admissions.html","PublicationWeek":"4/7-4/13","NewsletterEdition":"10","Status":"archived"},{"NewsletterID":"79","Title":"SAVE PLAN","Content":"Biden’s new student loan repayment plan, otherwise known as SAVE (Saving on a Valuable Education), is currently being challenged by Republican-led lawsuits. The SAVE Plan proposes to lower monthly payments and offers a quick route to paying off student debt, especially for low-income borrowers. The plan has already forgiven the loans of over 150,000 borrowers. However, Republicans have raised concerns about the tremendous cost of student loan cancellation.","Cover":"","RelevantSources":"https://apnews.com/article/student-debt-cancellation-college-forgiveness-f94b9706bd395b32e44d4d1b3f6ff051","PublicationWeek":"4/7-4/13","NewsletterEdition":"10","Status":"archived"},{"NewsletterID":"80","Title":"ARIZONA SUPREME COURT RULING","Content":"Biden’s new student loan repayment plan, otherwise known as SAVE (Saving on a Valuable Education), is currently being challenged by Republican-led lawsuits. The SAVE Plan proposes to lower monthly payments and offers a quick route to paying off student debt, especially for low-income borrowers. The plan has already forgiven the loans of over 150,000 borrowers. However, Republicans have raised concerns about the tremendous cost of student loan cancellation.","Cover":"","RelevantSources":"https://apnews.com/article/arizona-abortion-ban-what-to-know-797a4bbbc738497fe2284d6870c5be24","PublicationWeek":"4/7-4/13","NewsletterEdition":"10","Status":"archived"},{"NewsletterID":"81","Title":"ITALY HYDROELECTRIC PLANT EXPLOSION","Content":"Near Bologna, a deadly explosion at an Italian hydroelectric plant claimed at least three lives, injured five, and left four workers missing, prompting search and rescue operations amid challenging conditions. The blast occurred during maintenance work, causing flooding and structural collapse at the Enel Green Power plant, with ongoing investigations to determine the exact cause of the accident.","Cover":"","RelevantSources":"https://abcnews.go.com/International/wireStory/4-missing-search-continues-italys-hydroelectric-plant-rocked-109073731","PublicationWeek":"4/7-4/13","NewsletterEdition":"10","Status":"archived"},{"NewsletterID":"82","Title":"ESPRESSO - SABRINA CARPENTER","Content":"“SAY YOU CAN’T SLEEP, BABY, I KNOW THAT’S THAT ME ESPRESSO”","Cover":"","RelevantSources":"","PublicationWeek":"4/7-4/13","NewsletterEdition":"10","Status":"archived"},{"NewsletterID":"83","Title":"MAX AZZARELLO","Content":"Outside the courthouse where Trump’s hush money trial is ongoing, Florida Resident Max Azzarello set himself on fire. Last Friday, witnesses saw Azzarello handing out pamphlets on conspiracy theories, dousing himself with an accelerant, and setting himself on fire. Due to the critical condition of his injuries, Azzarello died in a hospital on Friday night.","Cover":"","RelevantSources":"https://apnews.com/article/trump-trial-hush-money-protest-fire-ab7601b86e423d79702b1dda84c5623e","PublicationWeek":"4/14-4/20","NewsletterEdition":"11","Status":"archived"},{"NewsletterID":"84","Title":"AUSTRALIA","Content":"A 16-year-old shocked congregation at Christ the Good Shepherd Church in Sydney, Australia, after stabbing Bishop Mar Mari Emmanuel and Rev. Isaac Royel during a service on Monday night that was being streamed online. Video of the attack soon circulated on social media, and an outraged mob descended around the church, demanding retribution. They threw bricks, bottles, and fence boards at police, who momentarily trapped the boy inside the church for his safety.","Cover":"","RelevantSources":"https://abcnews.go.com/International/wireStory/high-profile-stabbing-rock-sydney-recent-days-declared-109288225","PublicationWeek":"4/14-4/20","NewsletterEdition":"11","Status":"archived"},{"NewsletterID":"85","Title":"CORAL REEF BLEACHING","Content":"The National Oceanic and Atmospheric Administration (NOAA) reports the fourth global coral reef bleaching event and the second in the last decade, highlighting the severe impact of rising ocean temperatures on coral ecosystems worldwide. Since February 2023, mass coral bleaching has been observed across major ocean basins with significant bleaching in both the Northern and Southern Hemispheres, posing a threat to coral health and biodiversity.","Cover":"","RelevantSources":"https://abcnews.go.com/International/4th-global-coral-reef-bleaching-event-underway-oceans/story?id=109260007","PublicationWeek":"4/14-4/20","NewsletterEdition":"11","Status":"archived"},{"NewsletterID":"86","Title":"UNIVERSITY OF SOUTHERN CALIFORNIA","Content":"The University of Southern California cancelled the speech of 2024 valedictorian Asna Tabassum. Shortly after, filmmaker Jon M. Chu’s speech was also cancelled by USC. Having publicly expressed her support for Palestine, Tabassum’s speech was cancelled due to safety and security concerns. Provost and senior vice president Andrew T. Guzman publicly stated that her speaking would incite “substantial” security risks, and that the university “cannot ignore the fact that similar risks have led to harassment and even violence at other campuses.”","Cover":"","RelevantSources":"https://apnews.com/article/usc-muslim-valedictorian-speech-canceled-palestinians-israel-7b481db2d4e0db040b091bf8457f0b3f","PublicationWeek":"4/14-4/20","NewsletterEdition":"11","Status":"archived"},{"NewsletterID":"87","Title":"COLUMBIA UNIVERSITY","Content":"In fact, on the campus of Columbia University, pro-Palestinian protests have raised concerns about anti-semitism. A pro-Palestinian coalition called for a boycott of university events until the university lifts student suspensions and withdraw financial support from Israel. Last Wednesday, Columbia University President Dr. Minouche Shafik testified before Congress, given increasing anti-semitic hostility towards pro-Israeli and Jewish students.","Cover":"","RelevantSources":"https://www.cbsnews.com/newyork/news/antisemitism-on-college-campuses-columbia-university-president-shafik-testifies-before-congress/","PublicationWeek":"4/14-4/20","NewsletterEdition":"11","Status":"archived"},{"NewsletterID":"88","Title":"NORTH KOREA","Content":"North Korea claims to have launched a super-large cruise missile warhead and a new anti-aircraft missile in a western coastal area, as it strengthens its military capabilities in the face of rising tensions with the United States and South Korea. According to North Korean state media, on Friday, the missile administration conducted a “power test” and test launch for these two missles, respectively, meeting an undisclosed certain goal.”","Cover":"","RelevantSources":"https://abcnews.go.com/International/wireStory/north-korea-tested-super-large-cruise-missile-warhead-109444125","PublicationWeek":"4/14-4/20","NewsletterEdition":"11","Status":"archived"},{"NewsletterID":"89","Title":"ILLUSION BY DUA LIPA","Content":"“OOH, IT’S AMUSING YOU THINK I’M GONNA FALL FOR ILLUSION DANCE ALL NIGHT”","Cover":"","RelevantSources":"","PublicationWeek":"4/14-4/20","NewsletterEdition":"11","Status":"archived"},{"NewsletterID":"90","Title":"1864 ABORTION BAN","Content":"Last Wednesday, the Arizona House voted to repeal the controversial 1864 abortion ban (See Newsletter #10), a law that bans nearly all abortions, with the exception of saving the life of the pregnant mother. Three Republicans joined the Democrats in the effort to repeal the ban, with the final vote being 32-28. The bill is now headed for the Arizona Senate. Should the bill pass the Senate, Governor Katie Hobbs will sign the bill into law.","Cover":"","RelevantSources":"https://abcnews.go.com/Politics/republicans-join-arizona-democrats-vote-repeal-controversial-1864/story?id=109589269","PublicationWeek":"4/21-4/27","NewsletterEdition":"12","Status":"archived"},{"NewsletterID":"91","Title":"TIKTOK BAN","Content":"Last week, Biden signed the TikTok Ban bill, which gave ByteDance, its Chinese-based parent company, a deadline of nine months to sell TikTok (and an additional three months if a sale is underway). The app is not currently banned, but will disappear from Apple and Google app stores if a ban is enforced. Lawmakers have raised concerns that China could influence ByteDance to manipulate the content on TikTok. ByteDance has denied all allegations. However, a set of Chinese national security laws, of which ByteDance is subjected to, mandates all its organizations and citizens to aid the Chinese government in efforts to gather intelligence.","Cover":"","RelevantSources":"https://apnews.com/article/tiktok-divestment-ban-what-you-need-to-know-5e1ff786e89da10a1b799241ae025406","PublicationWeek":"4/21-4/27","NewsletterEdition":"12","Status":"archived"},{"NewsletterID":"92","Title":"KAREN BASS","Content":"Last Sunday, an intruder smashed one of the glass windows of Getty Home, the home of Los Angeles Mayor Karen Bass, breaking in. At the time of the break-in, the mayor and her family were home. The LAPD arrested the intruder, who is currently in custody. The mayor and her family are unharmed and safe. The identified suspect, 29-year-old Ephraim Matthew Hunter, has been charged with first-degree residential burglary and is being held on $100,000 bail. Hunter has been previously charged with kidnapping and attempted murder, back in 2015.","Cover":"","RelevantSources":"https://www.cbsnews.com/losangeles/news/suspect-arrested-after-breaking-into-mayor-karen-bass-home/","PublicationWeek":"4/21-4/27","NewsletterEdition":"12","Status":"archived"},{"NewsletterID":"93","Title":"TRUMP ON TRIAL","Content":"Former National Enquirer publisher David Pecker, longtime Trump assistant Rhona Graff, and Michael Cohen's (Trump’s previous lawyer) banker Gary Farro testified at the New York Supreme Court in the Donald Trump Hush Money Trial. Pecker testified about his role in the hush money payments to former Playboy model Karen McDougal and adult film actress Stormy Daniels, both of whom have been rumored to have affairs with Trump. As of now, Trump faces 34 felony counts of falsifying business records related to the payments. Trump has denied allegations of his affairs and has pleaded not guilty.","Cover":"","RelevantSources":"https://www.nbcnews.com/politics/donald-trump/live-blog/trump-trial-hush-money-case-live-updates-rcna149466","PublicationWeek":"4/21-4/27","NewsletterEdition":"12","Status":"archived"},{"NewsletterID":"94","Title":"DRAKE","Content":"Drake's Taylor Made Freestyle was pulled after Tupac Shakur's estate threatened legal action over the use of an AI-generated version of Shakur's voice without consent, violating publicity rights. The controversy arose amid rap tensions, with Drake's response to Kendrick Lamar's remarks highlighting legal complexities in music's intellectual property landscape.","Cover":"","RelevantSources":"https://www.nbcnews.com/pop-culture/pop-culture-news/drake-pulls-taylor-made-freestyle-tupac-estate-threatens-action-appare-rcna149592","PublicationWeek":"4/21-4/27","NewsletterEdition":"12","Status":"archived"},{"NewsletterID":"95","Title":"UNIVERSITY PROTESTS","Content":"Throughout the U.S., Pro-Palestinian protests run rampant on university campuses. Hundreds of students have been and continue to be arrested by the police, several universities having called the police. These student protesters have demanded their schools divest funds that aid Israel At Columbia University, students are camping on the school’s main lawn, in protest of the Israel-Hamas War, demanding divestment. Columbia also banned a student spokesperson for the Columbia University Apartheid Divest coalition who said “Zionists don’t deserve to live” These protests have also been widespread at universities such as Arizona State University, Barnard College, Denver Colleges, Emory University, George Washington University, Ohio State University, University of North Carolina at Chapel Hill, University of Southern California, University of Texas at Austin, Virginia Tech, New York University, Yale University, etc","Cover":"","RelevantSources":"https://www.cnn.com/business/live-news/university-protests-palestine-04-28-24/index.html","PublicationWeek":"4/21-4/27","NewsletterEdition":"12","Status":"archived"},{"NewsletterID":"96","Title":"FORTNIGHT BY TAYLOR SWIFT","Content":"“AND FOR A FORTNIGHT THERE, WE WERE FOREVER RUN INTO YOU SOMETIMES, ASK ABOUT THE WEATHER ”","Cover":"","RelevantSources":"","PublicationWeek":"4/21-4/27","NewsletterEdition":"12","Status":"archived"},{"NewsletterID":"97","Title":"1864 ABORTION BAN","Content":"Last Thursday, the 1864 abortion ban (see Newsletter #12) was repealed by Arizona's governor Katie Hobbs. On Wednesday, the Arizona Senate, in a 16-14 vote, with two GOP lawmakers joining the Democrats, gave legislative approval to repeal the 1864 ban. The repeal will take effect in the fall, and the state's prevailing abortion law will be a 15-week abortion ban.","Cover":"","RelevantSources":"https://apnews.com/article/abortion-arizona-women-1864-hobbs-d617843b7616c5c7f8a55424fd52dfa0","PublicationWeek":"4/28-5/4","NewsletterEdition":"13","Status":"archived"},{"NewsletterID":"98","Title":"FLORIDA ABORTION BAN","Content":"Last Wednesday, Florida's six-week abortion ban (women will no longer be able to have abortions after six weeks of pregnancy) went into effect. Shortly after, Vice President Kamala Harris visited Jacksonville, Florida, where she blamed former President Trump for the abortion ban, given that he appointed three U.S. Supreme Court justices - justices who voted to overturn Roe v. Wade. The ban has a few exceptions: saving the woman's life, rape, and incest. Pro-choice supporters have expressed concerns that the ban will curb access to health care. Pro-life supporters, however, argued that this ban will save unborn lives.","Cover":"","RelevantSources":"https://apnews.com/article/florida-abortion-ban-9509a806453e1eab50d118aaecffa2f1","PublicationWeek":"4/28-5/4","NewsletterEdition":"13","Status":"archived"},{"NewsletterID":"99","Title":"SOUTH KOREA","Content":"Doctors in South Korea are protesting President Yoon Suk Yeol's plan to increase medical school enrollment, due to a shortage of physicians, leading to disruptions in healthcare services. Critics of doctors, however, have argued that they are trying to protect their elite status in South Korea’s hierarchical society in keeping medical school admissions selective. Public opinion has turned against the government, with many calling for negotiations to resolve the standoff with doctors.","Cover":"","RelevantSources":"https://www.nytimes.com/2024/05/01/world/asia/korea-doctors-strike-yoon.html","PublicationWeek":"4/28-5/4","NewsletterEdition":"13","Status":"archived"},{"NewsletterID":"100","Title":"RFK JR. CONTRACTER","Content":"Last Saturday, RFK Jr.'s ballot access contractor Trent Pool was arrested on the charges of Criminal Obstruction of Breathing and Assault. He allegedly assaulted an unidentified 25-year-old woman, wrapped his hand around [the woman's] neck making it hard for her to breath and then struck her with a closed fist, causing pain. He is scheduled for a court appearance in June. Robert F. Kennedy Jr is an Independent running for President, with around 9 percent of the vote. Pool's firm, Accelevate 2020, has been paid almost 400,000 for campaign consulting by the Kennedy campaign.","Cover":"","RelevantSources":"https://abcnews.go.com/Politics/rfk-jr-contractor-arrested-allegedly-assaulting-woman-new/story?id=109907884","PublicationWeek":"4/28-5/4","NewsletterEdition":"13","Status":"archived"},{"NewsletterID":"101","Title":"MET GALA 2024","Content":"The Met Gala, also known as the Costume Institute Benefit, is an annual fundraiser and high-profile fashion event held at the Metropolitan Museum of Art in New York City. This year's event will take place on May 6. The theme for the 2024 Met Gala is Sleeping Beauties: Reawakening Fashion, with a dress code of The Garden of Time, inspired by a 1962 short story by J.G. Ballard. The event will feature celebrity hosts Zendaya, Jennifer Lopez, Bad Bunny, Chris Hemsworth, and Anna Wintour.","Cover":"","RelevantSources":"https://www.vogue.com/tag/event/met-gala","PublicationWeek":"4/28-5/4","NewsletterEdition":"13","Status":"archived"},{"NewsletterID":"102","Title":"COLLEGE CAMPUSES","Content":"Over 2,300 pro-Palestinian protestors have been arrested on US college campuses: Columbia University's main commencement ceremony may be cancelled, due to security concerns. The final decision is unclear. 100 people were arrested at Columbia University's Hamilton Hall by NYPD officers. Hamilton Hall has been littered with broken furniture and shattered windows. NYU and the New School requested the NYPD to clear out Pro-Palestinian encampments, with dozens of protesters being arrested. Over 1,700 alumni from the University of Southern California have pledged to withhold their donations until the university divests funds from Israel. Over 200 protestors were arrested on UCLA's campus by police in riot gear, as police dismantled a Pro-Palestine encampment at UCLA; at least one professor was arrested. These campus protests have gained international traction, with college campuses in London, Australia, Paris, Rome, etc. following suit.","Cover":"","RelevantSources":"https://www.nbcnews.com/news/us-news/live-blog/campus-protests-live-updates-portland-state-library-cleared-rcna150536","PublicationWeek":"4/28-5/4","NewsletterEdition":"13","Status":"archived"},{"NewsletterID":"103","Title":"DOWN BAD BY TAYLOR SWIFT","Content":"“NOW I’M DOWN BAD, CRYING AT THE GYM EVERYTHING COMES TEENAGE PETULANCE”","Cover":"","RelevantSources":"","PublicationWeek":"4/28-5/4","NewsletterEdition":"13","Status":"archived"},{"NewsletterID":"104","Title":"RFK JR.","Content":"Robert F. Kennedy Jr., an independent currently running for president (See Newsletter #13), confirmed that a parasitic worm ate a part of his brain, and subsequently died in his brain. The worm may have caused memory loss and cognitive issues for RFK. His symptoms appeared shortly after a diagnosis of mercury poisoning in 2012. Kennedy, however, has offered to “eat 5 more brain worms and still beat President Trump and President Biden in a debate.”","Cover":"","RelevantSources":"https://www.cbsnews.com/news/rfk-jr-parasitic-brain-worm-mercury-poisoning/","PublicationWeek":"5/5-5/11","NewsletterEdition":"14","Status":"archived"},{"NewsletterID":"105","Title":"BIRD FLU","Content":"The H5N1 virus, a pathogenic bird flu virus, has been found in wild animals, dairy herds (cows) on farms, and, recently, in commercially available milk. However, the lack of consistent bird flu testing may be potentially obscuring the extent to which bird flu testing has impacted animals and people in the US. Cats and dogs are vulnerable to the bird virus, in which potential transmissions to humans exist (1 individual was reported to be diagnosed with the bird flu in NYC due to transmission from a cat in 2016). Symptoms can range from mild to severe: fever, eye infections, fatigue, to severe respiratory diseases and pneumonia.","Cover":"","RelevantSources":"https://www.usatoday.com/story/graphics/2024/05/10/bird-avian-flu-cows-humans/73614602007/","PublicationWeek":"5/5-5/11","NewsletterEdition":"14","Status":"archived"},{"NewsletterID":"106","Title":"HAILEY BEIBER","Content":"Justin and Hailey Bieber announced their pregnancy via Instagram, sharing a slideshow post featuring a video of their wedding vow renewal and photos showcasing Hailey's baby bump. Hailey is over six month pregnant, and the announcement received warm congratulations from friends and fans, including the Jenner-Kardashian sisters.","Cover":"","RelevantSources":"https://www.nbcnews.com/pop-culture/pop-culture-news/justin-hailey-bieber-announce-pregnancy-instagram-post-rcna151550","PublicationWeek":"5/5-5/11","NewsletterEdition":"14","Status":"archived"},{"NewsletterID":"107","Title":"ANTISEMITISM IN K-12 SCHOOLS","Content":"Last Wednesday, leaders from NYC Public Schools, the Berkeley Unified School District in California, and Montgomery County Public Schools testified before a House Education and Workforce subcommittee, under the allegations and reports of antisemitism in K-12 schools. Pro-Palestinian student protests have occurred on both U.S. universities and, increasingly, high schools. Republicans have pressed school officials on the lack of punitive measures, such as firing, against principals and teachers. At a school in the Berkley district, the phrase “Kill Jews” was written in a high school bathroom.","Cover":"","RelevantSources":"https://apnews.com/article/antisemitism-congress-public-schools-gaza-acf92208a9ea0ef4878c6ba993ed1d83","PublicationWeek":"5/5-5/11","NewsletterEdition":"14","Status":"archived"},{"NewsletterID":"108","Title":"DRAKE VS. KENDRICK LAMAR","Content":"Drake and Kendrick Lamar, two generation-defining rappers, transformed a decade of competitiveness into increasingly personal attacks with the release of new diss tracks. Lamar's songs, including Euphoria and Not Like Us, are currently dominating the online conversation and streaming charts, acknowledging some of the most serious claims against him, including pedophilia.","Cover":"","RelevantSources":"https://www.nytimes.com/2024/05/08/arts/music/kendrick-lamar-drake-beef.html","PublicationWeek":"5/5-5/11","NewsletterEdition":"14","Status":"archived"},{"NewsletterID":"109","Title":"TRUMP","Content":"Trump may potentially owe a $100 million-plus tax bill if he loses the IRS audit fight over a Chicago skyscraper. According to an IRS (Internal Revenue Service) inquiry, Trump has dubiously claimed improper tax breaks from his Chicago tower. Porn Actor Stormy Daniels testified at Trump’s hush money trial about a sexual encounter with Trump in 2006, followed up with hush-money payments.","Cover":"","RelevantSources":"https://www.axios.com/2024/05/07/stormy-daniels-testify-trump-trial-new-york","PublicationWeek":"5/5-5/11","NewsletterEdition":"14","Status":"archived"},{"NewsletterID":"110","Title":"HAITI","Content":"Many are calling for Haiti's police commander to be fired and arrested after highly armed gangs started a new offensive in Haiti capital Port-au-Prince. Armed men stormed the capital late Friday, wounding people, burning cars, and attacking homes and other infrastructure as dozens fled into the neighboring mountains after a barrage of gunfire overnight, prompting over 3,700 people to abandon their homes.","Cover":"","RelevantSources":"https://abcnews.go.com/International/wireStory/haitians-demand-resignation-arrest-countrys-police-chief-after-110135426","PublicationWeek":"5/5-5/11","NewsletterEdition":"14","Status":"archived"},{"NewsletterID":"111","Title":"I HAD SOME HELP BY POST MALONE","Content":"“I HAD SOME HELP IT AIN’T LIKE I CAN HELP MAKE THIS KIND OF MESS all by myself”","Cover":"","RelevantSources":"","PublicationWeek":"5/5-5/11","NewsletterEdition":"14","Status":"archived"},{"NewsletterID":"112","Title":"BIDEN-TRUMP DEBATES","Content":"President Biden and former President Trump have agreed to debate each other on June 27th, in an Atlanta CNN studio with no live audience, and September 10th, hosted by ABC News. On X, Biden wrote “Trump says he’ll arrange his own transportation…I’ll bring my plane, too. I plan on keeping it for another four years.”","Cover":"","RelevantSources":"https://apnews.com/article/trump-biden-debate-negotiations-19c44db099680cab6fe702638394cd82","PublicationWeek":"5/12-5/18","NewsletterEdition":"15","Status":"current"},{"NewsletterID":"113","Title":"JOHN HOPKINS","Content":"After a 13-day protest at John Hopkins University, students agree to end a pro-Palestinian encampment and vacate the front lawn of the campus. In exchange, Hopkins will take the question of divestment from Israel under serious consideration. Unlike aggressive protests at other universities, Hopkins demonstrations were relatively peaceful. In March or June 2025, the board of trustees plans on meeting to discuss the Public Interest Investment Advisory Committee proposal for divestment.","Cover":"","RelevantSources":"https://www.baltimoresun.com/2024/05/12/johns-hopkins-encampment-end/","PublicationWeek":"5/12-5/18","NewsletterEdition":"15","Status":"current"},{"NewsletterID":"114","Title":"BILLIE EILISH","Content":"Billie Eilish's third album, Hit Me Hard and Soft, delves into themes of love, introspection, and societal pressures, showcasing her growth as an artist. The album combines haunting ballads, upbeat tracks, and experimental sounds, highlighting Eilish's versatility and willingness to push musical boundaries.","Cover":"","RelevantSources":"https://www.nytimes.com/2024/05/17/arts/music/billie-eilish-hit-me-hard-and-soft-review.html","PublicationWeek":"5/12-5/18","NewsletterEdition":"15","Status":"current"},{"NewsletterID":"115","Title":"$1 BILLION ARMS DEAL","Content":"Billie Eilish's third album, Hit Me Hard and Soft, delves into themes of love, introspection, and societal pressures, showcasing her growth as an artist. The album combines haunting ballads, upbeat tracks, and experimental sounds, highlighting Eilish's versatility and willingness to push musical boundaries.","Cover":"","RelevantSources":"https://apnews.com/article/us-israel-arms-gaza-ebe971ca8878ff430ce6458c04151585","PublicationWeek":"5/12-5/18","NewsletterEdition":"15","Status":"current"},{"NewsletterID":"116","Title":"ALAMEDA COUNTY","Content":"In Alameda County, California, prosecutors have allegedly excluded Black and Jewish jurors from serving in death penalty cases for decades - since 1977. Evidence suggests that there have been up to 35 cases engaged in this discriminatory practice. The newfound evidence has prompted a review of all those cases Alameda County District Attorney Pamela Price is reviewing all the capital convictions involved, which may result in new trials and potentially overturned convictions.","Cover":"","RelevantSources":"https://www.abajournal.com/news/article/prosecutors-excluded-jewish-people-from-juries-in-one-california-county-for-decades-review-suggests","PublicationWeek":"5/12-5/18","NewsletterEdition":"15","Status":"current"},{"NewsletterID":"117","Title":"TRUMP","Content":"Michael Cohen, Donald Trump's former lawyer and fixer, is set to testify in Trump's criminal trial, detailing the $130,000 hush-money payment to Stormy Daniels, which Cohen claims was directed by Trump to hide damaging information during the 2016 election. Cohen, having served prison time for his role, faces attacks from Trump’s defense aiming to discredit him by focusing on his criminal record and motives.","Cover":"","RelevantSources":"https://www.nytimes.com/2024/05/12/nyregion/michael-cohen-trump-trial.html","PublicationWeek":"5/12-5/18","NewsletterEdition":"15","Status":"current"},{"NewsletterID":"118","Title":"DUBLIN-NEW YORK PORTAL","Content":"The Dublin-New York live video portal, a “portal” that links NYC and Bublin, was suspended due to inappropriate behavior, including mooning and flashing. The artist, Benediktas Gylys, urged users to maintain family-friendly conduct. Dublin City Council and New York promoters are working on solutions to prevent further disruptions, with plans to restore the portal later this week.","Cover":"","RelevantSources":"https://www.bbc.com/news/articles/c2898j1x28eo","PublicationWeek":"5/12-5/18","NewsletterEdition":"15","Status":"current"},{"NewsletterID":"119","Title":"LUNCH BY BILLIE EILISH","Content":"“I could eat that girl for lunch Yeah, she dances on my tongue“","Cover":"","RelevantSources":"","PublicationWeek":"5/12-5/18","NewsletterEdition":"15","Status":"current"}]